import {useNavigate} from "react-router-dom";

export default function SignupTerms() {
  const navigate = useNavigate();
  function handleSignupForm() {
    navigate("/signup/forms");
  }

  const terms = `이용약관
  제1조 (목적)
  이 약관은 isCourse(이하 "회사"라 함)가 운영하는 웹사이트(이하 "사이트"라 함)를 이용함에 있어 사이트와 이용자의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.
  
  제2조 (용어의 정의)
  "사이트"란 회사가 재화 또는 용역(이하 "서비스"라 함)을 이용자에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 설정한 가상의 영업장을 의미합니다.
  "이용자"란 사이트에 접속하여 이 약관에 따라 회사가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
  "회원"이란 사이트에 개인정보를 제공하여 회원등록을 한 자로서, 사이트의 정보를 지속적으로 제공받으며, 회사가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 의미합니다.
  "비회원"이란 회원에 가입하지 않고 회사가 제공하는 서비스를 이용하는 자를 말합니다.
  
  제3조 (약관의 게시와 개정)
  회사는 이 약관의 내용을 이용자가 쉽게 알 수 있도록 사이트 초기 서비스 화면에 게시합니다.
  회사는 약관의 규제에 관한 법률, 전자상거래 등에서의 소비자 보호에 관한 법률, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 관련 법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
  회사가 약관을 개정할 경우에는 적용 일자 및 개정 사유를 명시하여 현행 약관과 함께 사이트의 초기 화면에 그 적용 일자 7일 이전부터 적용 일자 전일까지 공지합니다.
  
  제4조 (서비스의 제공 및 변경)
  회사는 다음과 같은 서비스를 제공합니다:
  교육 콘텐츠 제공 서비스
  이용자가 작성한 콘텐츠의 관리 및 사용 서비스
  기타 회사가 정하는 서비스
  회사는 서비스의 품질 향상 또는 운영상, 기술상의 필요에 따라 제공하는 서비스의 내용을 변경할 수 있습니다.
  
  제5조 (서비스의 중단)
  회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신의 두절 등의 사유가 발생한 경우 서비스 제공을 일시적으로 중단할 수 있습니다.
  회사는 천재지변 또는 이에 준하는 불가항력으로 인해 서비스 제공이 불가능한 경우에는 서비스의 제공을 중단할 수 있습니다.
  
  제6조 (회원가입)
  이용자는 회사가 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의한다는 의사표시를 함으로써 회원가입을 신청합니다.
  회사는 다음 각 호에 해당하는 경우 회원가입을 승낙하지 아니할 수 있습니다:
  가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우
  등록 내용에 허위, 기재누락, 오기가 있는 경우
  기타 회원으로 등록하는 것이 사이트의 기술상 현저히 지장이 있다고 판단되는 경우
  
  제7조 (회원 탈퇴 및 자격 상실)
  회원은 언제든지 탈퇴를 요청할 수 있으며, 회사는 즉시 회원탈퇴를 처리합니다.
  회원이 다음 각 호의 사유에 해당하는 경우, 회사는 회원자격을 제한 및 정지시킬 수 있습니다:
  가입 신청 시에 허위 내용을 등록한 경우
  사이트를 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 한 경우
  
  제8조 (이용자의 의무)
  이용자는 다음 행위를 하여서는 안 됩니다:
  신청 또는 변경 시 허위 내용의 등록
  타인의 정보 도용
  회사의 명예를 손상시키거나 정상적인 운영을 방해하는 행위
  다른 이용자의 개인정보를 수집하거나 저장하는 행위
  
  제9조 (회사의 의무)
  회사는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며, 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 서비스를 제공하는 데 최선을 다합니다.
  회사는 이용자가 안전하게 인터넷 서비스를 이용할 수 있도록 이용자의 개인정보(신용정보 포함) 보호를 위해 보안 시스템을 갖추어야 합니다.
  
  제10조 (개인정보 보호)
  회사는 이용자의 개인정보를 보호하기 위해 관련 법령에서 정하는 바에 따라 보호조치를 강구합니다.
  회사는 이용자의 개인정보를 보호하기 위해 개인정보처리방침을 제정하고, 이를 사이트 초기 화면에 게시합니다.
  
  제11조 (저작권의 귀속 및 이용제한)
  회사가 작성한 저작물에 대한 저작권 기타 지적재산권은 회사에 귀속합니다.
  이용자는 사이트를 이용함으로써 얻은 정보 중 회사에 지적재산권이 귀속된 정보를 회사의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리 목적으로 이용하거나 제3자에게 이용하게 하여서는 안 됩니다.
  
  제12조 (면책조항)
  회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.
  회사는 이용자의 귀책사유로 인한 서비스 이용의 장애에 대하여 책임을 지지 않습니다.
  회사는 이용자가 서비스를 이용하여 기대하는 수익을 상실한 것에 대하여 책임을 지지 않으며, 그 밖의 서비스로 인해 발생한 손해 등에 대해서도 책임을 지지 않습니다.
  
  제13조 (분쟁의 해결)
  회사와 이용자는 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기 위해 성실히 협의합니다.
  이 약관에 명시되지 않은 사항이나 해석에 대해 분쟁이 발생할 경우, 회사와 이용자는 관계 법령 및 상관례에 따릅니다.
  
  부칙
  이 약관은 2024년 8월 16일부터 시행됩니다.
  `;

  return (
    <section className="px-4">
      <h2 className="text-xl font-semibold mb-4">회원가입</h2>
      <textarea className="textarea textarea-md textarea-bordered w-full mb-4" rows="10" readOnly defaultValue={terms}/>
      <button className="btn btn-wide block mx-auto" onClick={handleSignupForm}>동의하고 가입하기</button>
    </section>
  )
}